---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
source: html/1baf393c-26f6-74d2-06e0-25ffce8335fb.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null